app/Http/Controllers/PostController.php

select * from `likes` where `likes`.`post_id` in (1, 2, 4, 6, 8) and `likes`.`deleted_at` is null
select * from `posts` order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `posts`
---
    public function index()
    {
        $posts = Post::latest()->with(['user', 'likes'])->paginate(20);

delete from `posts` where `id` = 11
---
    public function destroy(Post $post)
    {
        $this->authorize('delete', $post);

        $post->delete();